IDEA Open Model
VariableType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Variable type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum VariableType
Public Enumeration VariableType
Members
Member name | Value | Description
Standard | 0 |  Standard
MobileEnvelope | 1 |  Mobile envelope
Seismicity | 2 |  Seismicity
NotSet | 3 |  variable loads is not set for some reasons - in fact loads is not variable
See Also
Reference
IdeaRS.OpenModel.Loading Namespace